---
type: CopyPasteOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# CopyPasteOptions

`Autodesk.Revit.DB.CopyPasteOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CopyPasteOptions | 2014 | `public CopyPasteOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetDuplicateTypeNamesHandler | 2014 | `public IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler ()` |
| Method | SetDuplicateTypeNamesHandler | 2014 | `public void SetDuplicateTypeNamesHandler ( IDuplicateTypeNamesHandler handler )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |